 
Artificial Intelligence and the Rising Threats of AI Scams
 
As artificial intelligence (AI) becomes a larger part of everyone’s lives, it’s important to understand the threat it poses to security.
 
AI refers to computers and machines that perform tasks normally requiring human intelligence. AI systems work by training on large amounts of data that is then analyzed and used to make decisions. There are many forms and functions of AI. Generative AI, for example, can generate content such as text, images, audio, and video.
 
Generative AI essentially consists of two components: a large volume of training data and a neural network, which is an algorithm that can independently learn from the training data and generate new content from it.
 
Scammers now use AI to enhance their crimes by convincingly impersonating people and mimicking legitimate companies and services.
 
Common Tactics Include:
•	AI can make email phishing attempts look very real. While poor grammar used to be a warning sign, AI now minimizes these errors.
 
•	Be cautious if an email creates a sense of urgency, especially if it appears to be from IT, reaching you to "fix" a computer issue. Check email addresses and URLs carefully – scammers may use minor changes, like replacing “o” with “0” or changing a domain from “.com” to “.org.”
 
•	Scammers can spoof phone numbers to look real or even use “deepfake” technology to mimic the voices or images of people. Always verify unusual requests independently.
 
•	Scammers may text you, impersonating family members, coworkers or companies to initiate a personal conversation or gather information.
 
•	Fraudsters use publicly available information like names, addresses, birthdays and photos. Voice and video impersonations can be created using only a few seconds from existing videos or an outgoing voicemail message. Pictures from social media can be easily altered.
How to protect yourself against AI-based scams.
•	Never click links in an email unless you’re certain it’s legitimate. 
•	Avoid answering calls or responding to texts from unknown numbers. If a suspicious or unknown text contains a link, don’t click it.
•	Keep personal information private and only share with trusted contacts.
•	Never share your login details, credentials with anyone 
•	Avoid sharing personal information in social media

 
By staying alert, we can protect ourselves from AI-enhanced threats.

